src/CFD/OpenFOAM/OpenFOAM-v2206-MUI/tutorials/heatTransfer/chtMultiRegionSimpleFoam/heatExchanger/constant/porous/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

porousToair
{
    type            constantHeatTransfer;

    interpolationMethod cellVolumeWeight;
    nbrRegion       air;
    master          true;

    nbrModel        airToporous;
    fields          (h);
    semiImplicit    no;
}


// ************************************************************************* //
